---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.SlotIndex
source: html/9de0301f-805c-1f35-b47e-81139db608ce.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.SlotIndex Property

The Slots where the Electrical System is located in its panel.

## Syntax (C#)
```csharp
public string SlotIndex { get; }
```

## Remarks
This property is used to retrieve the slots of the Electrical System.
 There may be one or more slot in use in which case they will be comma delimited.